Courses/7140/Lectures/Implementation/Languages/DSL/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>DSLs for Software Engineering</title>
<!-- 2016-07-20 Wed 07:58 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Prabhaker Mateti" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../"> HOME </a>
</div><div id="preamble" class="status">
<a href="../../"> ../../</a>
</div>
<div id="content">
<h1 class="title">DSLs for Software Engineering</h1>
<ol class="org-ol">
<li>The abstract of the paper by Anlauff and Sunbul:
<ol class="org-ol">
<li>Building a software product requires knowledge in both software
engineering and the domain the software is written for.
</li>

<li>However, common software engineering methods in fact exclude
domain experts    from the architectural design of a software
system, because the    generality of the notations defined by
these methods require expert    knowledge in the field of
software engineering and especially    software architecture. 
</li>

<li>In order to avoid this effect,    domain-specific languages
(DSL) have been proposed as an   alternative to the general
purpose languages being normally used in    software
architecture.
</li>

<li>One of the advantages of DSLs is that they are less cryptic and
easier to learn for domain experts. Of course, the design of
such a language requires deep understanding of the   problem
domain, on the other hand the existing tools for language
design are only mastered by a few experts.
</li>
</ol>
</li>

<li>Lecture using  <a href="./dsl-jlcanovas-slides-156.pptx">./dsl-jlcanovas-slides-156.pptx</a> 150+ slides
</li>
</ol>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> References</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>Javier Luis Canovas Izquierdo, Domain-specific Languages,
javier.canovas@inria.fr, <a href="./dsl-jlcanovas-slides-156.pptx">./dsl-jlcanovas-slides-156.pptx</a> 156
slides. 2013. Required Reading.
</li>

<li>Mernik, Marjan, Jan Heering, and Anthony M. Sloane. "<a href="http://people.cis.ksu.edu/~schmidt/505f14/Lectures/WhenDSL.pdf">When and how
to develop Domain-Specific Languages</a>", ACM Computing Surveys,
vol. 37, no. 4, 2005, pp 316-344.  Required Reading.
</li>

<li>Matthias Anlauff, Asuman Sunbul, "Domain Specific Languages in
Software Architecture", Technical University of Berlin,
<a href="http://www.kestrel.edu/home/people/ma/papers/DSLSA.pdf">http://www.kestrel.edu/home/people/ma/papers/DSLSA.pdf</a>. 1999.  One
of the early papers.  Recommended Reading.
</li>

<li><a href="http://martinfowler.com/books/dsl.html">http://martinfowler.com/books/dsl.html</a> Domain Specific Languages,
Language workbenches.  2010.  <a href="http://www.informit.com/articles/article.aspx?p=1592379">DSLs: An Introductory Example</a>, first
chapter of the book.  Highly Recommended Reading.
</li>

<li>Markus Voelter et al., DSL Engineering: Designing, Implementing and
Using Domain-Specific Languages, 2013, <a href="http://dslbook.org/">http://dslbook.org/</a>
 "Donationware".  Pretty good.  Recommended Reading.
</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2016 <a href="mailto:pmateti@wright.edu">pmateti@wright.edu</a> &bull; <a href="http://www.wright.edu/~pmateti"> www.wright.edu/~pmateti</a>  2016-01-11
</div>
</body>
</html>
